XMegaForArduino/arduino/variants/xmega128a1u/pins_arduino.h
#define USB_VID 0x16c0  /* Van Ooijen Technische Informatica */
#define USB_PID 0x05e1  /* name-based CDC/ACM device */

// Configuring default product name and vendor
// If you use the project defaults, it will result in a name-based device descriptor based on
//   https://raw.githubusercontent.com/arduino/ArduinoISP/master/usbdrv/USB-IDs-for-free.txt

#endif // !defined(USB_VID) || !defined(USB_PID)

#define CDC_ENABLED    /* enable CDC/ACM serial device */
//#define HID_ENABLED     /* enable HID interface */


// TEMPORARY - TX/RX LEDs for the USB interface

#define TX_LED_PIN (LED_BUILTIN-5) /* PQ0 */
#define RX_LED_PIN (LED_BUILTIN-4) /* PQ1 */

#define TX_RX_LED_INIT() { pinMode(TX_LED_PIN,OUTPUT); pinMode(RX_LED_PIN,OUTPUT); \
                           digitalWrite(TX_LED_PIN,0); digitalWrite(RX_LED_PIN,0); }
#define TXLED0() digitalWrite(TX_LED_PIN,0)
#define TXLED1() digitalWrite(TX_LED_PIN,1)
#define RXLED0() digitalWrite(RX_LED_PIN,0)
#define RXLED1() digitalWrite(RX_LED_PIN,1)


// xmega-specific - Interrupt 'vector number' assignments:

// Interrupts are PORT-SPECIFIC, not pin specific.
// pin 2 on any port is always asynchronous (except for 'R' which doesn't have a pin 2)
// all other pins can manage synchronous interrupts.  'wakeup' from sleep mode
// and other async interrupts must be on a 'pin 2', on ports A through E
//
// Each port has 2 separate interrupt vectors.  They can be assigned different pins.
// The same pin can also be assigned to both vectors on the same port, if desired.

#define PORTD_INT0  0
#define PORTD_INT1  1
#define PORTC_INT0  2
#define PORTC_INT1  3
#define PORTE_INT0  4
#define PORTE_INT1  5
#define PORTA_INT0  6
#define PORTA_INT1  7
#define PORTB_INT0  8
#define PORTB_INT1  9
#define PORTR_INT0  10
#define PORTR_INT1  11
#define PORTF_INT0  12
#define PORTF_INT1  13
#define PORTH_INT0  14
#define PORTH_INT1  15
#define PORTJ_INT0  16
#define PORTJ_INT1  17
#define PORTK_INT0  18
#define PORTK_INT1  19
#define PORTQ_INT0  20
#define PORTQ_INT1  21

#define EXTERNAL_NUM_INTERRUPTS 22 /* defined here instead of wiring_private.h - max value 32 */

// was in wiring_external.h, moved here
#define EXTERNAL_INT_0  0
#define EXTERNAL_INT_1  1
#define EXTERNAL_INT_2  2
#define EXTERNAL_INT_3  3
#define EXTERNAL_INT_4  4
#define EXTERNAL_INT_5  5
#define EXTERNAL_INT_6  6
#define EXTERNAL_INT_7  7
#define EXTERNAL_INT_8  8
#define EXTERNAL_INT_9  9
#define EXTERNAL_INT_10 10
#define EXTERNAL_INT_11 11
#define EXTERNAL_INT_12 12
#define EXTERNAL_INT_13 13
#define EXTERNAL_INT_14 14
#define EXTERNAL_INT_15 15
#define EXTERNAL_INT_16 16
#define EXTERNAL_INT_17 17
#define EXTERNAL_INT_18 18
#define EXTERNAL_INT_19 19
#define EXTERNAL_INT_20 20
#define EXTERNAL_INT_21 21



// xmega has 2 sets of UART and SPI.
// The default UART is assigned on Port D, pins PD2-3
// The default SPI is assigned on Port C, pins PC4-7
//
// Also there are multiple 2-wire ports, the default being assigned to PE0-1
// TODO:  assign to PC0-1 (TWIC) since TWIE appears to be broke-dick
//
// Standard GPIO pins are assigned as follows:
// PD0-7 Digital 0-7
// PC0-7 Digital 8-15
// PE0-7 digital 16-23
// PF0-7 digital 24-31
// PH0-7 digital 32-39
// PJ0-7 digital 40-47
// PK0-7 digital 48-55
// PQ0-3 digital 56-59
// PR0-1 digital 60-61
// PA0-7 analog A0-A7
// PB0-3 analog A8-A11
//
// '#define'ing DIGITAL_IO_PIN_SHIFT shifts this down by 2, and places PD0-1 on 20-21
// This is for Arduino 'atmega' compatibility with respect to existing shields, so that
// you don't have to re-map pin numbers with #defines in existing software that hard-codes them
// or makes assumptions about pin numbers vs functionality [except TWI won't ever match up]
//
// ALL PORT REMAP registers must be assigned to 0 (default mappings for pins)
// this puts PWM output on pins 0-3 for PORT E (the timers are split for C and D)
// Additionally, CLKOUT should be 0 (no clock outputs on any port/pin).
//
// TIMERS
// Timer 0 should be configured as 'Tx2' (for 8 PWM outputs) by default, essentially
// as a dual 8-bit timer, more or less compatible with the Arduino's 3 timers and
// supporting all 8 pins on ports C and D for PWM output.  Port C's timer supports
// the system clock.
//
// See 'D' manual chapter 13 for more on this

// --------------------------------------------
// DEFINITIONS FOR SERIAL PORTS AND DEFAULT TWI
// --------------------------------------------


// TWI ports - default is TWIE
#define DEFAULT_TWI TWIE

// the XMega128a1u has four TWI ports
#define TWI_PORT0 TWIE
#define TWI_VECTOR_S0 TWIE_TWIS_vect
#define TWI_VECTOR_M0 TWIE_TWIM_vect
#define TWI_PORT1 TWIC
#define TWI_VECTOR_S1 TWIC_TWIS_vect
#define TWI_VECTOR_M1 TWIC_TWIM_vect
#define TWI_PORT2 TWID
#define TWI_VECTOR_S2 TWID_TWIS_vect
#define TWI_VECTOR_M2 TWID_TWIM_vect
#define TWI_PORT3 TWIF
#define TWI_VECTOR_S3 TWIF_TWIS_vect
#define TWI_VECTOR_M3 TWIF_TWIM_vect
#define TWI_INTERFACE_COUNT 4


// obsolete - consider removal in all of them
//#define TWIC_VECT_ENABLE /* use this to select the correct interrupt vectors for default */

// serial port 0
#define SERIAL_0_PORT_NAME PORTD
#define SERIAL_0_USART_NAME USARTD0
#define SERIAL_0_USART_DATA USARTD0_DATA
#define SERIAL_0_RXC_ISR ISR(USARTD0_RXC_vect)
#define SERIAL_0_DRE_ISR ISR(USARTD0_DRE_vect)
//#define SERIAL_0_REMAP PORTD_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 0 */
#define SERIAL_0_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_0_REMAP is defined */
#define SERIAL_0_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_0_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTD0_VECTOR_EXISTS

// serial port 1
#define SERIAL_1_PORT_NAME PORTC
#define SERIAL_1_USART_NAME USARTC0
#define SERIAL_1_USART_DATA USARTC0_DATA
#define SERIAL_1_RXC_ISR ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR ISR(USARTC0_DRE_vect)
//#define SERIAL_1_REMAP PORTC_REMAP /* define THIS to re-map the pins from 0-3 to 4-7 on serial port 1 */
#define SERIAL_1_REMAP_BIT 4    /* the bit needed to remap the port if SERIAL_1_REMAP is defined */
#define SERIAL_1_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_1_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTC0_VECTOR_EXISTS

