XMegaForArduino/arduino/variants/xmega128a1u/pins_arduino.h
  (uint16_t) &PORTE_PIN4CTRL,  // PE 3 ** 20 **
  (uint16_t) &PORTE_PIN5CTRL,  // PE 3 ** 21 **
  (uint16_t) &PORTE_PIN6CTRL,  // PE 3 ** 22 **
  (uint16_t) &PORTE_PIN7CTRL,  // PE 3 ** 23 **

  (uint16_t) &PORTF_PIN0CTRL,  // PF 0 ** 24 ** SDA3
  (uint16_t) &PORTF_PIN1CTRL,  // PF 1 ** 25 ** SCL3
  (uint16_t) &PORTF_PIN2CTRL,  // PF 2 ** 26 **              ASYNC
  (uint16_t) &PORTF_PIN3CTRL,  // PF 3 ** 27 **
  (uint16_t) &PORTF_PIN4CTRL,  // PF 4 ** 28 **
  (uint16_t) &PORTF_PIN5CTRL,  // PF 5 ** 29 **
  (uint16_t) &PORTF_PIN6CTRL,  // PF 6 ** 30 **
  (uint16_t) &PORTF_PIN7CTRL,  // PF 7 ** 31 **

  (uint16_t) &PORTH_PIN0CTRL,  // PH 0 ** 32 **
  (uint16_t) &PORTH_PIN1CTRL,  // PH 1 ** 33 **
  (uint16_t) &PORTH_PIN2CTRL,  // PH 2 ** 34 **              ASYNC
  (uint16_t) &PORTH_PIN3CTRL,  // PH 3 ** 35 **
  (uint16_t) &PORTH_PIN4CTRL,  // PH 4 ** 36 **
  (uint16_t) &PORTH_PIN5CTRL,  // PH 5 ** 37 **
  (uint16_t) &PORTH_PIN6CTRL,  // PH 6 ** 38 **
  (uint16_t) &PORTH_PIN7CTRL,  // PH 7 ** 39 **

  (uint16_t) &PORTJ_PIN0CTRL,  // PJ 0 ** 40 **
  (uint16_t) &PORTJ_PIN1CTRL,  // PJ 1 ** 41 **
  (uint16_t) &PORTJ_PIN2CTRL,  // PJ 2 ** 42 **              ASYNC
  (uint16_t) &PORTJ_PIN3CTRL,  // PJ 3 ** 43 **
  (uint16_t) &PORTJ_PIN4CTRL,  // PJ 4 ** 44 **
  (uint16_t) &PORTJ_PIN5CTRL,  // PJ 5 ** 45 **
  (uint16_t) &PORTJ_PIN6CTRL,  // PJ 6 ** 46 **
  (uint16_t) &PORTJ_PIN7CTRL,  // PJ 7 ** 47 **

  (uint16_t) &PORTK_PIN0CTRL,  // PK 0 ** 48 **
  (uint16_t) &PORTK_PIN1CTRL,  // PK 1 ** 49 **
  (uint16_t) &PORTK_PIN2CTRL,  // PK 2 ** 50 **              ASYNC
  (uint16_t) &PORTK_PIN3CTRL,  // PK 3 ** 51 **
  (uint16_t) &PORTK_PIN4CTRL,  // PK 4 ** 52 **
  (uint16_t) &PORTK_PIN5CTRL,  // PK 5 ** 53 **
  (uint16_t) &PORTK_PIN6CTRL,  // PK 6 ** 54 **
  (uint16_t) &PORTK_PIN7CTRL,  // PK 7 ** 55 **

  (uint16_t) &PORTQ_PIN0CTRL,  // PQ 0 ** 56 **
  (uint16_t) &PORTQ_PIN1CTRL,  // PQ 1 ** 57 **
  (uint16_t) &PORTQ_PIN2CTRL,  // PQ 2 ** 58 **              ASYNC
  (uint16_t) &PORTQ_PIN3CTRL,  // PQ 3 ** 59 **

  (uint16_t) &PORTR_PIN0CTRL,  // PR 0 ** 60 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1 ** 61 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** the new 60 ** SDA2
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** the new 61 ** SCL2
#endif // DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTA_PIN0CTRL,  // PA 0 ** 62 ** A0
  (uint16_t) &PORTA_PIN1CTRL,  // PA 1 ** 63 ** A1
  (uint16_t) &PORTA_PIN2CTRL,  // PA 2 ** 64 ** A2           ASYNC
  (uint16_t) &PORTA_PIN3CTRL,  // PA 3 ** 65 ** A3
  (uint16_t) &PORTA_PIN4CTRL,  // PA 4 ** 66 ** A4
  (uint16_t) &PORTA_PIN5CTRL,  // PA 5 ** 67 ** A5
  (uint16_t) &PORTA_PIN6CTRL,  // PA 6 ** 68 ** A6
  (uint16_t) &PORTA_PIN7CTRL,  // PA 7 ** 69 ** A7
  (uint16_t) &PORTB_PIN0CTRL,  // PB 0 ** 70 ** A8
  (uint16_t) &PORTB_PIN1CTRL,  // PB 1 ** 71 ** A9
  (uint16_t) &PORTB_PIN2CTRL,  // PB 2 ** 72 ** A10         ASYNC
  (uint16_t) &PORTB_PIN3CTRL,  // PB 3 ** 73 ** A11
  (uint16_t) &PORTB_PIN4CTRL,  // PB 4 ** 74 ** A12
  (uint16_t) &PORTB_PIN5CTRL,  // PB 5 ** 75 ** A13
  (uint16_t) &PORTB_PIN6CTRL,  // PB 6 ** 76 ** A14
  (uint16_t) &PORTB_PIN7CTRL,  // PB 7 ** 77 ** A15
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** 0 **
  _PD,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 2 ** 2 ** USARTD_RX
  _PD,  // PD 3 ** 3 ** USARTD_TX
  _PD,  // PD 4 ** 4 **
  _PD,  // PD 5 ** 5 **
  _PD,  // PD 6 ** 6 **
  _PD,  // PD 7 ** 7 **
  _PC,  // PC 0 ** 8 **
  _PC,  // PC 1 ** 9 **
  _PC,  // PC 2 ** 10 **
  _PC,  // PC 3 ** 11 **
  _PC,  // PC 4 ** 12 ** SPI_SS
  _PC,  // PC 5 ** 13 ** SPI_MOSI
  _PC,  // PC 6 ** 14 ** SPI_MISO
  _PC,  // PC 7 ** 15 ** SPI_SCK
  _PE,  // PE 0 ** 16 ** SDA
  _PE,  // PE 1 ** 17 ** SCL
  _PE,  // PE 2 ** 18 **
  _PE,  // PE 3 ** 19 **

  _PE,  // PE 4 ** 20 **
  _PE,  // PE 5 ** 21 **
  _PE,  // PE 6 ** 22 **
  _PE,  // PE 7 ** 23 **

  _PF,  // PF 0 ** 24 ** SDA
  _PF,  // PF 1 ** 25 ** SCL
  _PF,  // PF 2 ** 26 **
  _PF,  // PF 3 ** 27 **
  _PF,  // PF 4 ** 28 **
  _PF,  // PF 5 ** 29 **
  _PF,  // PF 6 ** 30 **
  _PF,  // PF 7 ** 31 **

  _PH,  // PH 0 ** 32 ** SDA
  _PH,  // PH 1 ** 33 ** SCL
  _PH,  // PH 2 ** 34 **
  _PH,  // PH 3 ** 35 **
  _PH,  // PH 4 ** 36 **
  _PH,  // PH 5 ** 37 **
  _PH,  // PH 6 ** 38 **
  _PH,  // PH 7 ** 39 **

  _PJ,  // PJ 0 ** 40 ** SDA
  _PJ,  // PJ 1 ** 41 ** SCL
  _PJ,  // PJ 2 ** 42 **
  _PJ,  // PJ 3 ** 43 **
  _PJ,  // PJ 4 ** 44 **
  _PJ,  // PJ 5 ** 45 **
  _PJ,  // PJ 6 ** 46 **
  _PJ,  // PJ 7 ** 47 **

  _PK,  // PK 0 ** 48 ** SDA
  _PK,  // PK 1 ** 49 ** SCL
  _PK,  // PK 2 ** 50 **
  _PK,  // PK 3 ** 51 **
  _PK,  // PK 4 ** 52 **
  _PK,  // PK 5 ** 53 **
  _PK,  // PK 6 ** 54 **
  _PK,  // PK 7 ** 55 **

  _PQ,  // PE 0 ** 56 ** SDA
  _PQ,  // PE 1 ** 57 ** SCL
  _PQ,  // PE 2 ** 58 **
  _PQ,  // PE 3 ** 59 **

  _PR,  // PR 0 ** 60 **
  _PR,  // PR 1 ** 61 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** the new 60 **
  _PD,  // PD 1 ** the new 61 **
#endif // DIGITAL_IO_PIN_SHIFT
  _PA,  // PA 0 ** 62 ** A0
  _PA,  // PA 1 ** 63 ** A1
  _PA,  // PA 2 ** 64 ** A2
  _PA,  // PA 3 ** 65 ** A3
  _PA,  // PA 4 ** 66 ** A4
  _PA,  // PA 5 ** 67 ** A5
  _PA,  // PA 6 ** 68 ** A6
  _PA,  // PA 7 ** 69 ** A7
  _PB,  // PB 0 ** 70 ** A8
  _PB,  // PB 1 ** 71 ** A9
  _PB,  // PB 2 ** 72 ** A10
  _PB,  // PB 3 ** 73 ** A11
  _PB,  // PB 4 ** 74 ** A12
  _PB,  // PB 5 ** 75 ** A13
  _PB,  // PB 6 ** 76 ** A14
  _PB,  // PB 7 ** 77 ** A15
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  // PIN IN PORT
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** 0 **
  _BV( 1 ),  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 2 ),  // PD 2 ** 2 ** USARTD_RX
  _BV( 3 ),  // PD 3 ** 3 ** USARTD_TX
  _BV( 4 ),  // PD 4 ** 4 **
  _BV( 5 ),  // PD 5 ** 5 **
  _BV( 6 ),  // PD 6 ** 6 **
  _BV( 7 ),  // PD 7 ** 7 **
  _BV( 0 ),  // PC 0 ** 8 ** SDA TWIC
  _BV( 1 ),  // PC 1 ** 9 ** SCL TWIC
  _BV( 2 ),  // PC 2 ** 10 ** USARTC_RX
  _BV( 3 ),  // PC 3 ** 11 ** USARTC_TX
  _BV( 4 ),  // PC 4 ** 12 ** SPI_SS
  _BV( 5 ),  // PC 5 ** 13 ** SPI_MOSI
  _BV( 6 ),  // PC 6 ** 14 ** SPI_MISO
  _BV( 7 ),  // PC 7 ** 15 ** SPI_SCK
  _BV( 0 ),  // PE 0 ** 16 ** SDA TWIE
  _BV( 1 ),  // PE 1 ** 17 ** SCL TWIE
  _BV( 2 ),  // PE 2 ** 18 **
  _BV( 3 ),  // PE 3 ** 19 **
  _BV( 4 ),  // PE 4 ** 20 **
  _BV( 5 ),  // PE 5 ** 21 **
  _BV( 6 ),  // PE 6 ** 22 **
  _BV( 7 ),  // PE 7 ** 23 **

  _BV( 0 ),  // PF 0 ** 24 **
  _BV( 1 ),  // PF 1 ** 25 **
  _BV( 2 ),  // PF 2 ** 26 **
  _BV( 3 ),  // PF 3 ** 27 **
  _BV( 4 ),  // PF 4 ** 28 **
  _BV( 5 ),  // PF 5 ** 29 **
  _BV( 6 ),  // PF 6 ** 30 **
  _BV( 7 ),  // PF 7 ** 31 **

  _BV( 0 ),  // PH 0 ** 32 **
  _BV( 1 ),  // PH 1 ** 33 **
  _BV( 2 ),  // PH 2 ** 34 **
  _BV( 3 ),  // PH 3 ** 35 **
  _BV( 4 ),  // PH 4 ** 36 **
  _BV( 5 ),  // PH 5 ** 37 **
  _BV( 6 ),  // PH 6 ** 38 **
  _BV( 7 ),  // PH 7 ** 39 **

  _BV( 0 ),  // PJ 0 ** 40 **
  _BV( 1 ),  // PJ 1 ** 41 **
  _BV( 2 ),  // PJ 2 ** 42 **
  _BV( 3 ),  // PJ 3 ** 43 **
  _BV( 4 ),  // PJ 4 ** 44 **
  _BV( 5 ),  // PJ 5 ** 45 **
  _BV( 6 ),  // PJ 6 ** 46 **
  _BV( 7 ),  // PJ 7 ** 47 **

  _BV( 0 ),  // PK 0 ** 48 **
  _BV( 1 ),  // PK 1 ** 49 **
  _BV( 2 ),  // PK 2 ** 50 **
  _BV( 3 ),  // PK 3 ** 51 **
  _BV( 4 ),  // PK 4 ** 52 **
  _BV( 5 ),  // PK 5 ** 53 **
  _BV( 6 ),  // PK 6 ** 54 **
  _BV( 7 ),  // PK 7 ** 55 **

  _BV( 0 ),  // PQ 0 ** 56 **
  _BV( 1 ),  // PQ 1 ** 57 **
  _BV( 2 ),  // PQ 2 ** 58 **
  _BV( 3 ),  // PQ 3 ** 59 **

  _BV( 0 ),  // PR 0 ** 60 **
  _BV( 1 ),  // PR 1 ** 61 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** the new 60 **
  _BV( 1 ),  // PD 1 ** the new 61 **
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PA 0 ** 22 ** A0
  _BV( 1 ),  // PA 1 ** 23 ** A1
  _BV( 2 ),  // PA 2 ** 24 ** A2
  _BV( 3 ),  // PA 3 ** 25 ** A3
  _BV( 4 ),  // PA 4 ** 26 ** A4
  _BV( 5 ),  // PA 5 ** 27 ** A5
  _BV( 6 ),  // PA 6 ** 28 ** A6
  _BV( 7 ),  // PA 7 ** 29 ** A7
  _BV( 0 ),  // PB 0 ** 30 ** A8
  _BV( 1 ),  // PB 1 ** 31 ** A9
  _BV( 2 ),  // PB 2 ** 32 ** A10
  _BV( 3 ),  // PB 3 ** 33 ** A11
  _BV( 4 ),  // PB 4 ** 26 ** A12
  _BV( 5 ),  // PB 5 ** 27 ** A13
  _BV( 6 ),  // PB 6 ** 28 ** A14
  _BV( 7 ),  // PB 7 ** 29 ** A15
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // for now 'NOT_ON_TIMER' for all - later, assign timers based
  // on pins 0-3 being enabled as PWM out for ports A through E
  // corresponding to timers A through D (see D manual sections 11.12.14,
  // also see D manual sect 13.6 for using the 'compare' channel on 'TCx2' to generate
  // a PWM output.  Must select pin as output, _AND_ enable the 'compare' output
  // for the appropriate pin.  LCMPENx/HCMPENx registers to enable it.

